<?php

// Задание 1

$name = "Игорь Гудков";
$country = "Япония";
$photos_count = 324;
$dish = "Змеиная Страсть";
$place = "Акихабара";

echo "Этим летом мой лучший друг $name посетил такую прекрасную страну как $country. За всё время своего отпуска 
он успел сделать $photos_count фотографии. Он часто обедал в местных ресторанах и пришел к выводу, что его любимое 
японское блюдо \"$dish\". Конечно же, он не упустил возможность посетить такое место как - '$place'. Ему понравилось и 
теперь при каждой встрече он рекомендует мне посетить эту страну.\n";


// Задание 2

$a = 10;
$b = 5;

echo "$b из $a-ти студентов посетили лекцию.\n";
echo $b . ' из ' . $a . '-ти студентов посетили лекцию.';

// Задание 3

$var1 = "Доброе утро";
$var2 = "дамы";
$var3 = "и господа";

echo "\n" . $var1 . ", " . $var2 . " " . $var3;
